#include <iostream>
#include "Row.h"

// Головна функція програми
int main() {
	// Створюється об'єкт типу Row, який ініціалізується вектором символів {'1', '3', '5', '2', '4'}
	Row row(std::vector<char>{'1', '3', '5', '2', '4'});
	// Виводиться довжина вектора (кількість елементів)


	// Виводиться сам вектор (перевантажений оператор <<)
	std::cout << row << "\n";

	// Викликається метод, який видаляє першу п'ятірку з вектора
	row.removeFive();

	// Виводиться оновлений вектор (без символу '5')
	std::cout << row << "\n";
	std::cout << row.getLength() << "\n";

	return 0;
}

