#include <iostream>
#include "Row.h"
namespace std{}
int main() {
	// Створюється об'єкт Row, ініціалізований вектором символів {'1', '3', '5', '2', '4'}
	Row row(std::vector<char>{'1', '3', '5', '2', '4'});
	Row row1();
	// Виводиться довжина (кількість елементів) у векторі
	std::cout << row.getLength() << "\n";

	// Виводиться сам вектор символів за допомогою перевантаженого оператора <<
	std::cout << row << "\n";

	// Видаляється перше входження символу '5'
	row.removeFive();

	// Знову виводиться вектор після видалення '5'
	std::cout << row << "\n";

	return 0;
}
